Revit 2027 API
RebarShapeConstraint180DegreeDefaultBend Constructor
 Create a 180-degree bend constraint.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarShapeConstraint180DegreeDefaultBend()
Public Sub New
public:
RebarShapeConstraint180DegreeDefaultBend()
new : unit -> RebarShapeConstraint180DegreeDefaultBend
See Also
Reference
RebarShapeConstraint180DegreeDefaultBend Class
Autodesk.Revit.DB.Structure Namespace